In [2]:
import pandas as pd
import numpy as np

<font color = 'red'><h4>Comandos uteis

In [3]:
## Excluindo varias linhas
#df1 = dataset1.drop([0,1,3])
## excluindo coluna
#df1 = dataset1.drop(['nome da coluna'])
## excluindo coluna na
#df1 = df1.dropna(how='all', axis=1)
## Convertendo primeira linha em cabe√ßalho
#df2 = df1.rename(columns=df1.loc[2]).drop(df1.index[0])
## Alterando valor especifico
#df2.iat[1,0] = 'NaN'

<font color = 'red'><h4>Juntando tabelas

In [4]:
# importando csv
dados = pd.read_csv('binary.csv', sep=',')
df1 = pd.DataFrame(dados)
#df2 = df1.set_index('cod')

# criando lista no numpy
c1 = np.arange(0,5,1)
c2 = np.random.rand(5)
df2 = pd.DataFrame(zip(c1,c2), columns=['teste1','teste2'])

display(df1,df2)

   cod  admit  gre   gpa  rank
0    1      0  380  3.61     3
1    2      1  660  3.67     3
2    3      1  880  4.00     1
3    4      1  640  3.19     4
4    5      0  520  2.93     4

   teste1    teste2
0       0  0.389873
1       1  0.291329
2       2  0.396269
3       3  0.487925
4       4  0.816385

In [5]:
# Juntando tabelas
df3 = pd.concat([df1,df2], ignore_index=True)
df4 = pd.concat([df1,df2], keys=['tab1','tab2'])
display(df3,df4)

   cod  admit    gre   gpa  rank  teste1    teste2
0  1.0    0.0  380.0  3.61   3.0     NaN       NaN
1  2.0    1.0  660.0  3.67   3.0     NaN       NaN
2  3.0    1.0  880.0  4.00   1.0     NaN       NaN
3  4.0    1.0  640.0  3.19   4.0     NaN       NaN
4  5.0    0.0  520.0  2.93   4.0     NaN       NaN
5  NaN    NaN    NaN   NaN   NaN     0.0  0.389873
6  NaN    NaN    NaN   NaN   NaN     1.0  0.291329
7  NaN    NaN    NaN   NaN   NaN     2.0  0.396269
8  NaN    NaN    NaN   NaN   NaN     3.0  0.487925
9  NaN    NaN    NaN   NaN   NaN     4.0  0.816385

        cod  admit    gre   gpa  rank  teste1    teste2
tab1 0  1.0    0.0  380.0  3.61   3.0     NaN       NaN
     1  2.0    1.0  660.0  3.67   3.0     NaN       NaN
     2  3.0    1.0  880.0  4.00   1.0     NaN       NaN
     3  4.0    1.0  640.0  3.19   4.0     NaN       NaN
     4  5.0    0.0  520.0  2.93   4.0     NaN       NaN
tab2 0  NaN    NaN    NaN   NaN   NaN     0.0  0.389873
     1  NaN    NaN    NaN   NaN   NaN     1.0  0.291329
     2  NaN    NaN    NaN   NaN   NaN     2.0  0.396269
     3  NaN    NaN    NaN   NaN   NaN     3.0  0.487925
     4  NaN    NaN    NaN   NaN   NaN     4.0  0.816385

In [6]:
# fazendo concatena√ß√£o por colunas
df5 = pd.concat([df1,df2], keys=['tab1','tab2'], axis=1)
display(df5)

  tab1                         tab2
   cod admit  gre   gpa rank teste1    teste2
0    1     0  380  3.61    3      0  0.389873
1    2     1  660  3.67    3      1  0.291329
2    3     1  880  4.00    1      2  0.396269
3    4     1  640  3.19    4      3  0.487925
4    5     0  520  2.93    4      4  0.816385

<font color = 'red'><h4>Completando valores e ajustando planilhas

In [7]:
dataset1 = pd.read_excel('Arquivo.xlsx')
pd.DataFrame(dataset1)
display(dataset1)

   Unnamed: 0 Unnamed: 1 Unnamed: 2
0         NaN       name  sobrenome
1         NaN       joao      silva
2         NaN        NaN      silva
3         NaN      vitor       hugo
4         NaN        NaN       hugo
5         NaN        NaN       hugo
6         NaN    silvana     garcia
7         NaN        NaN     garcia
8         NaN        NaN     garcia

In [8]:
# Renomeando colunas com base na primeira linha
data1 = dataset1.rename(columns=dataset1.loc[0]).drop([0])
# Excluindo primeira coluna vazia
data1 = data1.drop(columns=data1.columns[[0]], axis=1)
# Corrigindo nome da coluna
data1 = data1.rename(columns={'name':'nome'})
display(data1)

      nome sobrenome
1     joao     silva
2      NaN     silva
3    vitor      hugo
4      NaN      hugo
5      NaN      hugo
6  silvana    garcia
7      NaN    garcia
8      NaN    garcia

In [9]:
dataset2 = data1.replace(np.nan, method='ffill')
display(dataset2)

      nome sobrenome
1     joao     silva
2     joao     silva
3    vitor      hugo
4    vitor      hugo
5    vitor      hugo
6  silvana    garcia
7  silvana    garcia
8  silvana    garcia

In [11]:
pd.DataFrame.to_excel(dataset2, excel_writer='Lista.xlsx', sheet_name='Dados', index=False)